
{
    "recipes": [
        {
            "id": "rec1",
            "dishImage": "assets/food_pics/desserts_mangomisu.jpeg",
            "title": "Mangomisu",
            "duration": "2 hours 30 mins",
            "source": "https://www.taste.com.au/recipes/mangomisu/2cc39062-ada1-4ba9-86a2-5b71484937cb?r=recipes/top50desserts&c=6xS57Mzz/Top%2050%20desserts",
            "information": [
                "Course: Dessert",
                "Price: Cheap",
                "Cuisine: Meditarrian",
                "Skill Level: Beginner",
                "Prep Time 5 minutes"
            ],
            "details": "Bring in the favour of summer with this relaxed mango dessert that will delight your tastebuds.",
            "ingredients": ["500g mascarpone cheese",
                "600ml thickened cream",
                "1/3 cup (50g) icing sugar",
                "2 egg yolks",
                "1 vanilla bean, split, seeds scraped",
                "1/2 cup (125ml) Grand Marnier",
                "Juice of 2 oranges300g savoiardi",
                "3 mangoes, flesh sliced 1cm thick"],
            "steps": ["Line the base of a 22cm springform cake pan with plastic wrap or baking paper. Place the mascarpone, thickened cream, icing sugar, egg yolks and vanilla seeds in the bowl of an electric mixer and beat on high speed until thick and well combined.",
                "Combine the Grand Marnier and orange juice in a separate bowl. Dip half the sponge fingers into the juice mixture and layer in the base of the cake pan. Spread with one-third of the mascarpone mixture, and top with one-third of the mango slices. Repeat the process, then top with the remaining mascarpone mixture, reserving the remaining mango slices to serve. Cover the cake and chill for 2 hours or until firm.",
                "Meanwhile for the raspberry sauce, place the sugar and 2 tablespoons water in a small pan over medium heat, stirring to dissolve the sugar. Cool slightly, then add the berries and lemon juice. Whiz in a food processor until smooth, then pass through a sieve. Chill until ready to serve. (You can store the sauce, covered, in the fridge for 3-4 days).",
                "To serve, carefully remove the sides and base of the cake pan and transfer the mangomisu to a platter. Decorate with curls of the reserved mango, then slice and serve with berry sauce."
            ]


        },
        {
            "id": "rec2",
            "dishImage": "assets/food_pics/desserts_angel_food_cake.jpeg",
            "title": "Angel Food Cake",
            "duration": "30 mins",
            "source": "https://www.taste.com.au/recipes/angel-food-cake/6e31de9e-e150-4078-84b6-7bed0bccbca6?r=recipes/top50desserts&c=6xS57Mzz/Top%2050%20desserts",
            "information": [
                "Course: Dessert",
                "Price: Somewhat cheap",
                "Cuisine: American",
                "Skill Level: Amateur",
                "Prep Time 5 hours"
            ],
            "details": "Create a heavenly mouth-feel with this pretty-in-pink, sugar-petaled angel food cake.",
            "ingredients": ["12 egg whites",
                "1 1/2 tsp cream of tartar",
                "315g (1 1/2 cups) caster sugar",
                "150g (1 cup) self-raising flour",
                "Pink food colouring, to tint",
                "300g (2 cups) icing sugar",
                "2 tbsp water",
                "1 tsp rose water"],
            "steps": ["For the sugared rose petals, line a tray with baking paper. Carefully peel off rose petals, selecting medium, nicely-shaped petals. Lightly whisk egg white until slightly foamy. Brush petals lightly with egg white. Sprinkle with sugar and shake off excess. Place on prepared tray and set aside for 2-3 hours to dry.",
            "Preheat oven to 180C/160C fan forced. Use electric beaters to beat egg whites in a clean, dry bowl until soft peaks form. Beat in the cream of tartar until just combined. Gradually add 155g (3/4 cup) of the sugar, in 4 batches, beating well after each addition until sugar dissolves. Sift flour and remaining sugar together 3 times. Gently fold flour mixture and a little food colouring into egg white mixture. Spread mixture into a 21cm (base measurement) ungreased angel food cake pan (see Notes). Smooth the surface and wipe side of pan clean. Bake for 20-25 minutes or until mixture springs back slightly when touched.",
            "Immediately invert the pan onto a wire rack (see Notes). Allow the cake to cool completely in pan. Once cool, gently run a palette knife around both sides of the pan to loosen cake. Gently ease the cake out of the pan. Place upside down on serving plate.",
            "Combine the icing sugar, water and rosewater in a heatproof bowl. Place bowl over a pan of simmering water (don’t let the bowl touch the water). Cook, stirring, until smooth and mixture is the consistency of pouring cream. Tint pale pink with food colouring. Drizzle icing over top of cake, allowing icing to drip down the side. Set aside to set. Decorate with sugared rose petals."]
        },
        {
            "id": "rec3",
            "dishImage": "assets/food_pics/desserts_almond_date_cake.jpeg",
            "title": "Almond and Date Cake",
            "duration": "35 mins",
            "source": "https://pixabay.com/photos/pancakes-maple-syrup-sweet-food-2291908/",
            "information": [
                "Course: Dessert",
                "Price: Cheap",
                "Cuisine: American",
                "Skill Level: Beginner",
                "Prep Time 20 minutes"
            ],
            "details": "Get a quick gluten-free sweet fix with these almond and date cakes.",
            "ingredients": ["1 tbsp rice flour, plus extra for dusting",
                "4 egg whites",
                "1/2 lemon, juiced",
                "1/2 cup caster sugar",
                "1 1/4 cups almond meal",
                "1 tbsp cocoa powder",
                "1 cup dates, sliced",
                "1/4 cup Coles Dried Cranberries"],
            "steps": ["Preheat oven to 180C. Lightly grease a 20cm spring-form pan and dust with a little rice flour. Line bottom with baking paper.",
            "In a large bowl, using an electric mixer, beat egg whites with a few drops of lemon juice until soft peaks form. Gradually add sugar, beating until glossy, firm peaks form.",
            "Fold in almond meal, cocoa and remaining lemon juice. Toss dates and cranberries with the rice flour and gently fold into the mixture.",
            "Spoon mixture into prepared pan. Bake for 30-35 mins until the cake begins to pull away from the sides of the pan.",
            "For the Lemon Glaze: In a small bowl, mix icing sugar with enough lemon juice to make it spreadable.",
            "Cool cake in pan on a wire rack for 5 mins, then loosen the sides of the pan and remove. While still warm, top with lemon glaze and serve in slices."]
        },
        {
            "id": "rec4",
            "dishImage": "assets/food_pics/desserts_cinnamon_honey.jpeg",
            "title": "Cinnamon Honey Creme Brulee",
            "duration": "1 hour",
            "source": "https://www.taste.com.au/recipes/cinnamon-honey-creme-brulee/712109b3-1b8d-4d77-8da7-0b4fb7527365?r=recipes/top50desserts&c=6xS57Mzz/Top%2050%20desserts",
            "information": [
                "Course: Dessert",
                "Price: Expensive",
                "Cuisine: Italian",
                "Skill Level: Beginner",
                "Prep Time 15 minutes"
            ],
            "details": "The kitchens of Martha Stewart show us how to create a perfect balance in every bite: the honey in the rich custard plays off the spicy cinnamon in the crunchy sugar topping.",
            "ingredients": ["3 cups thickened cream",
                "1 cup milk",
                "4 cinnamon sticks",
                "1/4 tsp salt",
                "1/4 cup honey",
                "1/2 cup caster sugar",
                "9 large egg yolks",
                "1/2 cup caster sugar, extra"],
            "steps": ["Bring cream, milk, cinnamon sticks and salt to a simmer in a medium saucepan over medium heat, stirring often. Remove from heat. Set aside for 1 hour to allow flavours to develop.",
                "Preheat oven to 150°C/130°C fan-forced. Strain milk mixture through a fine sieve over a bowl. Return to pan. Add honey and 1/4 cup sugar. Bring to a simmer, stirring to dissolve sugar. Whisk egg yolks and remaining sugar in a heatproof bowl. Gradually whisk hot milk mixture into egg mixture. Strain mixture through sieve over a heatproof jug.",
                "Divide custard evenly between 8 x 3/4-cup (180ml capacity) ramekins. Place in a large roasting pan. Pour enough boiling water into pan to come halfway up sides of dishes.",
                "Bake for 45 to 50 minutes or until set around the edges, but still wobbly in centres. Carefully remove dishes from water and transfer to a wire rack to cool. Cover with plastic wrap. Refrigerate overnight (or up to 3 days).",
                "Just before serving, place dishes in freezer for 20 minutes. Using half the extra sugar, sprinkle a thin layer over the top of each custard. Using a kitchen blowtorch or a preheated grill on medium-high, caramelise sugar for 1 to 2 minutes or until golden. Repeat with another layer of remaining sugar. Serve."]
        },
        {
            "id": "rec5",
            "dishImage": "assets/food_pics/desserts_apple_berry_crumble.jpeg",
            "title": "Apple Berry Crumble",
            "duration": "10 mins",
            "source": "https://www.taste.com.au/recipes/10-minute-apple-berry-crumble/685880f5-3157-418f-a9f1-7645babf87ac?r=recipes/top50desserts&c=6xS57Mzz/Top%2050%20desserts",
            "information": [
                "Course: Dessert",
                "Price: Cheap",
                "Cuisine: Thai",
                "Skill Level: Beginner",
                "Prep Time 10 minutes"
            ],
            "details": "Ditch fancy and finicky desserts for this delicious and fast crumble.",
            "ingredients": ["2 x 400g cans pie apple filling",
                "1 tsp ground cinnamon",
                "1 tsp finely grated lemon rind",
                "2 tbsp mixed berry jam",
                "1 cup toasted muesli",
                "Double cream, to serve"],
            "steps": ["Combine apple, cinnamon and lemon rind in a bowl. Divide jam between 4 (1 1/4 cup-capacity) heatproof, microwave-safe dishes. Top with apple mixture. Cover with plastic wrap. Microwave on HIGH (100%) for 2½ minutes or until heated through.",
            "Sprinkle muesli on top of apple mixture. Microwave on MEDIUM (50%), uncovered, for 15 to 20 seconds or until muesli is just warm. Serve hot with double cream."]
        },
        {
            "id": "rec6",
            "dishImage": "assets/food_pics/desserts_choc_block.jpeg",
            "title": "Choc a Block",
            "duration": "35 mins",
            "source": "https://www.taste.com.au/recipes/choc-block/0681b5a9-12f1-435d-b627-7b0ea6df37ec?r=recipes/top50desserts&c=6xS57Mzz/Top%2050%20desserts",
            "information": [
                "Course: Dessert",
                "Price: Medium",
                "Cuisine: Thai",
                "Skill Level: Amateur",
                "Prep Time 15 minutes"
            ],
            "details": "Indulge yourself with our best-ever chocolate pudding, served with lashings of cream, caramel, nuts and even marshmallows.",
            "ingredients": ["1 3/4 cups self-raising flour, sifted",
                "2 tbsp cocoa powder, sifted",
                "1/2 cup brown sugar",
                "1 cup milk",
                "125g butter, melted",
                "1/2 cup milk chocolate chips",
                "380g can caramel Top ‘n’ Fill, stirred",
                "1/4 cup roasted salted peanuts, chopped",
                "300ml tub thickened cream, whipped",
                "White mini marshmallows, to decorate",
                "Milk chocolate chips, extra, to decorate",
                "Salted peanuts, roasted, chopped"],
            "steps": ["Preheat oven to 180C/160C fan-forced. Combine flour, cocoa and sugar in a bowl. Add milk and butter. Stir well. Stir in chocolate chips.",
            "Spoon half the batter over base of a 10 cup-capacity ovenproof dish. Level with a spatula. Top with caramel, spreading with spatula. Sprinkle with peanuts. Spoon remaining batter over the top. Carefully spread batter evenly, making sure it goes to the edge of dish.",
            "Make Sauce. Combine sugar, cocoa and boiling water in a heatproof jug. Pour sauce over the back of a large spoon, over top of pudding. Bake for 35 to 40 minutes or until top is just firm. Stand for 5 minutes. Dollop with whipped cream and decorate with marshmallows, extra chocolate chips and peanuts. Serve immediately."]
        },
        {
            "id": "rec7",
            "dishImage": "assets/food_pics/desserts_mints.jpeg",
            "title": "After Dinner Mints",
            "duration": "10 mins",
            "source": "https://www.taste.com.au/recipes/after-dinner-mints-2/11905116-7d51-453c-9bf6-6555fae7769e?r=recipes/top50desserts&c=6xS57Mzz/Top%2050%20desserts",
            "information": [
                "Course: Dessert",
                "Price: Cheap",
                "Cuisine: Vietnamese",
                "Skill Level: Hard",
                "Prep Time 50 minutes"
            ],
            "details": "Chocolate is always high on the agenda, and with these simple dinner mints, it's easy to satisfy the cravings.",
            "ingredients": ["375g NESTLÉ BAKERS' CHOICE Dark Choc Melts",
                "2 1/2 cups pure icing sugar",
                "1 tbsp vegetable oil",
                "2 tbsp milk",
                "1/4 tsp peppermint essence"],
            "steps": ["Grease a 6cm-deep, 20cm square cake pan.",
            "Line base and sides with baking paper, allowing a 3cm overhang on all sides.",
            "Place half the melts in a microwave-safe bowl. Microwave on high (100 per cent) for 1 to 2 minutes or until smooth, stirring with a metal spoon every 30 seconds.",
            "Pour chocolate over base of prepared pan. Refrigerate for 15 minutes or until set.",
            "Sift icing sugar in a microwave-safe bowl. Stir in oil and milk to form a thick paste. Microwave on high for 2 to 3 minutes, or until smooth, stirring every 30 seconds. Stir in peppermint essence. Set aside for 2 minutes to cool slightly. (If mixture is too thick, add 1 tablespoon milk).",
            "Pour peppermint mixture over chocolate in pan, spreading with a spatula. Refrigerate for 15 minutes or until just set.",
            "Place remaining chocolate in a microwave-safe bowl. Microwave on high for 1 to 2 minutes or until smooth, stirring with a metal spoon every 30 seconds.",
            "Pour chocolate over peppermint layer.",
            "Refrigerate until set.",
            "Lift chocolate from pan and, using a warm knife, cut after-dinner mints into squares."]
        },
        {
            "id": "rec8",
            "dishImage": "assets/food_pics/desserts_banana_split.jpeg",
            "title": "Banana Split",
            "duration": "3 mins",
            "source": "https://www.taste.com.au/recipes/banana-split/3b01b775-2be2-4a15-9326-0ca09178b1eb?r=recipes/top50desserts&c=6xS57Mzz/Top%2050%20desserts",
            "information": [
                "Course: Dessert",
                "Price: Cheap",
                "Cuisine: American",
                "Skill Level: Easy",
                "Prep Time 5 minutes"
            ],
            "details": "Revisit the desserts of yesteryear with this traditional banana split that satisfies.",
            "ingredients": ["1 banana, peeled, cut lengthwise",
                "2 scoops vanilla ice-cream",
                "3 pecans, chopped",
                "100g dark chocolate, broken into squares",
                "1/4 cup thickened cream",
                "1 tbsp Kahlua, optional"],
            "steps": ["To make chocolate sauce: Place chocolate and cream in a microwavesafe jug. Microwave, uncovered, on HIGH (100%) power for 2 to 3 minutes, stirring every minute with a metal spoon or until smooth. Stir in Kahlua, if desired.",
            "Place banana slices on a plate. Top with scoops of ice-cream.",
                "Drizzle with chocolate sauce. Sprinkle with nuts. Serve."]
        }
    ]
}